In [2]:
import pandas as pd

Задание 1

In [4]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [6]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],'price': [450, 300, 350, 500, 450, 370, 290]})
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [7]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [13]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4

In [31]:
authors_stat1 = authors_price.groupby('author_name')['price'].min()
authors_stat1

author_name
Островский    290
Тургенев      300
Чехов         450
Name: price, dtype: int64

In [15]:
authors_stat2 = authors_price.groupby('author_name')['price'].max()
authors_stat2

author_name
Островский    370
Тургенев      450
Чехов         500
Name: price, dtype: int64

In [16]:
authors_stat3 = authors_price.groupby('author_name')['price'].mean()
authors_stat3

author_name
Островский    330.000000
Тургенев      366.666667
Чехов         475.000000
Name: price, dtype: float64

In [21]:
authors_stat0 = pd.merge(authors_stat1, authors_stat2, on = 'author_name', how = 'inner')
authors_stat0

             price_x  price_y
author_name
Островский       290      370
Тургенев         300      450
Чехов            450      500

In [22]:
authors_stat = pd.merge(authors_stat0, authors_stat3, on = 'author_name', how = 'inner')
authors_stat

             price_x  price_y       price
author_name
Островский       290      370  330.000000
Тургенев         300      450  366.666667
Чехов            450      500  475.000000

In [35]:
authors_stat.rename(columns = {'price_x' : 'min_price', 'price_y' : 'max_price','price' : 'mean_price'})

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000